[
  {
    "time_to_read": "6 min",
    "date_of_blog": "2025-09-20",
    "title": "How Omega-3 Fatty Acids Support Brain Function",
    "content": "Omega-3 fatty acids, commonly found in fish, walnuts, and flaxseeds, are vital for maintaining healthy brain cell membranes. Studies suggest they can reduce symptoms of depression and anxiety by supporting neurotransmitter activity. Including two servings of fatty fish a week or supplementing with flaxseed oil may help boost overall mental well-being.",
    "author": "Dr. Ananya Rao"
  },
  {
    "time_to_read": "4 min",
    "date_of_blog": "2025-09-15",
    "title": "The Role of Probiotics in Reducing Stress",
    "content": "Gut health is closely connected to mental health through the gut-brain axis. Probiotic-rich foods like yogurt, kimchi, and kefir may lower cortisol levels and improve mood. Adding fermented foods to your diet can be a simple way to improve gut health, which in turn helps regulate stress and anxiety.",
    "author": "Michael Thompson"
  },
  {
    "time_to_read": "7 min",
    "date_of_blog": "2025-09-10",
    "title": "How B-Vitamins Boost Energy and Reduce Fatigue",
    "content": "B-vitamins, including B6, B9, and B12, play a key role in producing neurotransmitters such as serotonin and dopamine. A deficiency in these vitamins is often linked to fatigue, irritability, and poor concentration. Whole grains, leafy greens, and eggs are excellent sources of B-vitamins that support mental clarity and energy.",
    "author": "Sarah Patel"
  },
  {
    "time_to_read": "5 min",
    "date_of_blog": "2025-09-05",
    "title": "Hydration and Its Impact on Cognitive Performance",
    "content": "Even mild dehydration can impair mood, focus, and memory. Drinking enough water throughout the day is essential for optimal brain function. Herbal teas and water-rich fruits like cucumbers and oranges can also contribute to staying hydrated, which in turn supports better mental performance.",
    "author": "Dr. Rakesh Menon"
  },
  {
    "time_to_read": "7 min",
    "date_of_blog": "2025-09-05",
    "title": "Postassium Intake and Its Impact on Cognitive Performance",
    "content": "Even mild dehydration can impair mood, focus, and memory. Drinking enough water throughout the day is essential for optimal brain function. Herbal teas and water-rich fruits like cucumbers and oranges can also contribute to staying hydrated, which in turn supports better mental performance.",
    "author": "Dr. Kayan Irani"
  }
]
